lisir233/ESP-Iris/components/esp_iris/test_apps/services_usb/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_IRIS_TRANSPORT_USB=y
CONFIG_ESP_IRIS_MEDIA_LATEST_BYTES=3840
CONFIG_ESP_IRIS_MAX_RPC_HANDLERS=12
CONFIG_ESP_IRIS_MAX_FILE_VOLUMES=4
CONFIG_TINYUSB_CDC_RX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_TX_BUFSIZE=8192
CONFIG_TINYUSB_CDC_EP_BUFSIZE=8192
CONFIG_ESP_IRIS_TASK_STACK_SIZE=3328

CONFIG_ESP_IRIS_FIRMWARE_ROLE=1
